app/controllers/accounts_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."uid" = ? AND "accounts"."passcode" = ?  ORDER BY "accounts"."id" ASC LIMIT 1  [["uid", 20863], ["passcode", "2324"]]
---
    def set_account
      @account =  Account.where(uid: params[:id], passcode: params[:passcode])