app/controllers/accounts_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."useid" = ? AND "accounts"."passcode" = ? LIMIT 1  [["useid", "26809"], ["passcode", "234"]]
---
  def index
    chain_client = Rails.application.config.chain_client
    response = {}
    if params['flag'] == "balance"
      balance = chain_client.get_bucket_asset_balance(params["bucket_id"])
      respond_to do |format|
        format.html { render :text => balance.to_json.to_s}
      end
    end
    if params['flag'] == "bucket_id"
      @account  = Account.where(useid: params[:useid], passcode: params[:passcode]).take

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."useid" = ? AND "accounts"."passcode" = ? LIMIT 1  [["useid", "33870"], ["passcode", "132"]]
---
    def set_account
      @account =  Account.where(useid: params[:id], passcode: params[:passcode])